# DWFImportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFImportOptions Class
Members See Also
---
The import options used by importing DWF or DWFx format file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DWFImportOptions : IDisposable
```

Visual Basic
---
```text
Public Class DWFImportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DWFImportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..DWFImportOptions
# See Also
DWFImportOptions Members
Autodesk.Revit.DB Namespace